###############################################################################
# Created by write_sdc
###############################################################################
current_design vsdbabysoc
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 9.4500 
set_clock_uncertainty -setup 0.4725 clk
set_clock_uncertainty -hold 0.7560 clk
###############################################################################
# Environment
###############################################################################
set_input_transition 0.7560 [get_ports {ENb_CP}]
set_input_transition 0.7560 [get_ports {ENb_VCO}]
set_input_transition 0.7560 [get_ports {REF}]
set_input_transition 0.7560 [get_ports {VCO_IN}]
set_input_transition 0.7560 [get_ports {VREFH}]
###############################################################################
# Design Rules
###############################################################################
